#+OPTIONS: toc:t H:3
#+AUTHOR: Zhengchao Xu
#+EMAIL: xuzhengchaojob@gmail.com

#+TITLE: OrgMode常用表格处理公式
* 单一表项的使用
1. 列使用 *$N* 表示, 或相对位置 *$-/+N*. $< 第一行, $> 最后一行. $0, 当前列.
2. 行使用 *@*. 
3. 公式中使用相对位置. 该相对位置一般是指要求结果的表格的相对位置.
   例如下面的公式, 就是将 @2$4 这个表格的 "上一行左移3个" 位置的表格中的
   值加上4.
   #+BEGIN_EXAMPLE
   #+TBLFM: @2$4=@-1$-3+4
   #+END_EXAMPLE
* 范围的使用
使用两个 dot 即 *..* 来表示范围, 例如 
1. $1..$3. 表示当前行的前三个元素.
2. @2$1..@4$3, 表示一块6个表格的正方形区域

* 使用其他表项或其他文件中的表
1. 使用remote(file, ref)
2. 其他表必须可以被引用, 例如可以用 "#+NAME" 修饰. file也可以是一个
   表格项, 该项的内容必须是另外一个表格的合法引用.
3. ref是指远程表格的一个合法表项.

* 常用公式
1. 使用Lisp代码需要前面加上' 
2. 两列相加: $X = $M + $N. 或者 Lisp代码 '(+ $M $N);N'
   也可以
   需要说明的是: 如果第一行是表头, (即第二行是 ---- ), 第一行不会相加.
   例如下面的例子. 但是行相加会作用在第一行上.
   #+BEGIN_EXAMPLE
   #+NAME: tbl1
|  9 | 1 |  2 | 0 | 2 |
|----+---+----+---+---|
|  1 | 3 |  4 | 0 | 1 |
| 10 | 3 | 13 | 0 | 3 |
|  1 | 3 |  4 | 0 | 1 |
|----+---+----+---+---|
|  3 | 9 | 12 |   |   |
#+TBLFM: $3=$1+$2
   #+END_EXAMPLE
3. 多列相加: vsum($M..$N). 或者 '(apply '+ '($M..$N));N
4. 时间计算, 时间格式必须为 HH:MM[:SS], 后面接 *T* 则结果会同样
   显示为时间, 接 *t* 则会表示为小数, 例如
   #+BEGIN_EXAMPLE
|         |        |      |          |
|---------+--------+------+----------|
|    1:00 |   2:23 | 3:33 | 06:56:00 |
| 3:01:20 | 2:11:2 | -9:2 |    -3.83 |
#+TBLFM: @2$4=$1+$2+$3;T::@3$4=$1+$2+$3;t
 
   #+END_EXAMPLE
* 让第一列自动显示行号的几个函数
效果如下:  
#+BEGIN_EXAMPLE
| N |   |
|---+---|
| 1 |   |
| 2 |   |
| 3 |   |
| 4 |   |
#+END_EXAMPLE
1. ~#+TBLFM: $1=@-1+1::@2$1=1~
   注意: 
   + 如果用这个函数, 第一在函数上运行 "C-c C-c", 结果会显示不正确, 
     必需再重复一次快捷键.
   + 可以在表格的任一域内使用 "C-u C-u C-c C-c" 来显示正确结果.
2. ~#+TBLFM: @3$1..@>$1=@-1+1::@2$1=1~
3. ~#+TBLFM: $1=@#-1~
